<b>Python Basics (Lists,Dict,Series, Comprehensions)<b>

<b>LISTS<b>

In [2]:
color = ["Red","Blue","Green"]

In [3]:
color

['Red', 'Blue', 'Green']

In [5]:
color[0] ##List Index starts from 0
##Use ## in front to start commmenting

'Red'

In [6]:
color[4]  ## As we dont have list index that has fourth element, we get an error

IndexError: list index out of range

In [7]:
len(color)  ##SHows the lenght of a list

3

In [12]:
newList = [1,2,[4,5],'c','d']  ##Mixed up list containing both numbers another list and charaters

In [13]:
newList

[1, 2, [4, 5], 'c', 'd']

In [15]:
color.append('Orange')

In [16]:
color

['Red', 'Blue', 'Green', 'Orange']

In [18]:
color.extend(['Yellow','Pink'])

In [19]:
color

['Red', 'Blue', 'Green', 'Orange', 'Yellow', 'Pink']

Difference between append and extend
https://stackoverflow.com/questions/252703/what-is-the-difference-between-pythons-list-methods-append-and-extend

In [21]:
color[0:2] ##from 0th element to 2nd element where element in index 2 is not included

['Red', 'Blue']

In [23]:
color[:4]

['Red', 'Blue', 'Green', 'Orange']

In [24]:
color[2:]

['Green', 'Orange', 'Yellow', 'Pink']

<b>Dictionaries<b>

In [29]:
dict = {'A':'1','B':'2','C':'3','D':'4'}

In [30]:
dict['C']

'3'

In [31]:
dict['E'] ## So any KeyError in pyton will specify , you are tryng to access an element which is actually not there

KeyError: 'E'

In [32]:
for key,values in dict.items():
    print(key + ',' + values)

A,1
B,2
C,3
D,4

<b>Comprehensions<b>

In [34]:
squares = []

for i in range(5):
    squares.append(i**2)

In [35]:
squares

[0, 1, 4, 9, 16]

In [36]:
dupsquares = [i**2 for i in range(5)]  ##comprehension

In [37]:
dupsquares

[0, 1, 4, 9, 16]

<b>PANDAS<b>

In [38]:
import pandas as pd

In [39]:
ser = pd.Series([0,1,2,3,4,5,6,7], name='PDseries')

In [40]:
ser

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
Name: PDseries, dtype: int64

In [43]:
ser.index

RangeIndex(start=0, stop=8, step=1)

In [44]:
ser.values

array([0, 1, 2, 3, 4, 5, 6, 7], dtype=int64)

In [45]:
lang = pd.Series([100,99,98,97,96,95,94,93,92,91],index=['Java','C','C++','Python','C#','PHP','JS','Ruby','R','Matlab'])

In [46]:
lang.index

Index(['Java', 'C', 'C++', 'Python', 'C#', 'PHP', 'JS', 'Ruby', 'R', 'Matlab'], dtype='object')

In [47]:
lang[0:2]

Java    100
C        99
dtype: int64

In [48]:
lang['Python']

97

In [49]:
lang['C#':'R']## Please note that when using custom indxes the last value is included

C#      96
PHP     95
JS      94
Ruby    93
R       92
dtype: int64

In [51]:
lang[4:8] ##Please note that when using numeric indexes that last value is not displayed

C#      96
PHP     95
JS      94
Ruby    93
dtype: int64

In [53]:
lang.iloc[4:8] ##Explicit specifying, workd for numeric indexes

C#      96
PHP     95
JS      94
Ruby    93
dtype: int64

In [54]:
lang.loc['C#':'R'] ##Explicit specifying

C#      96
PHP     95
JS      94
Ruby    93
R       92
dtype: int64

In [55]:
lang[lang > 95]

Java      100
C          99
C++        98
Python     97
C#         96
dtype: int64

<b>Data Frames<b>

In [57]:
lang1 = pd.Series([100,99.9,98.8,97.7,96.5,95.4,94.2,93,92,91],index=['Java','C','C++','Python','C#','PHP','JS','Ruby','R','Matlab'])

In [58]:
lang2 = pd.Series([100,99.2,98.4,97.2,96.0,95.5,94.1,93.7,92,91],index=['Java','C','C++','Python','C#','PHP','JS','Ruby','R','Matlab'])

In [59]:
combined = pd.DataFrame({'First':lang1 , 'Second':lang2})

In [60]:
combined

        First  Second
Java    100.0   100.0
C        99.9    99.2
C++      98.8    98.4
Python   97.7    97.2
C#       96.5    96.0
PHP      95.4    95.5
JS       94.2    94.1
Ruby     93.0    93.7
R        92.0    92.0
Matlab   91.0    91.0

In [68]:
combined = combined.sort_values('Second',ascending=False)

In [69]:
combined

        First  Second
Java    100.0   100.0
C        99.9    99.2
C++      98.8    98.4
Python   97.7    97.2
C#       96.5    96.0
PHP      95.4    95.5
JS       94.2    94.1
Ruby     93.0    93.7
R        92.0    92.0
Matlab   91.0    91.0

In [70]:
combined[4:8] ##Please note that when using numeric indexes that last value is not displayed

      First  Second
C#     96.5    96.0
PHP    95.4    95.5
JS     94.2    94.1
Ruby   93.0    93.7

In [71]:
combined.iloc[4:8] ##Explicit specifying, workd for numeric indexes

      First  Second
C#     96.5    96.0
PHP    95.4    95.5
JS     94.2    94.1
Ruby   93.0    93.7

In [72]:
combined.loc['C#':'R'] ##Explicit specifying

      First  Second
C#     96.5    96.0
PHP    95.4    95.5
JS     94.2    94.1
Ruby   93.0    93.7
R      92.0    92.0

In [73]:
import seaborn  as sns

In [78]:
flights = sns.load_dataset('flights')

In [80]:
flights = flights.set_index(['year','month'])

In [81]:
flights

                passengers
year month
1949 January           112
     February          118
     March             132
     April             129
     May               121
...                    ...
1960 August            606
     September         508
     October           461
     November          390
     December          432

[144 rows x 1 columns]

In [83]:
##Multi level Indexing
flights.loc[1959].loc['January']

passengers    360
Name: January, dtype: int64

In [101]:
tips = pd.read_csv('tips.csv')

In [104]:
tips.head() ##Displys the first five rows  tips.tail() displays last five rows

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [107]:
tips.describe()  ##Provides a numerical description of the data frame

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [108]:
tips.groupby('day').mean() ##Group by a particular column

      total_bill       tip      size
day
Fri    17.151579  2.734737  2.105263
Sat    20.441379  2.993103  2.517241
Sun    21.410000  3.255132  2.842105
Thur   17.682742  2.771452  2.451613

In [109]:
tips.groupby(['day','smoker']).mean() ##Group by a particular columns

             total_bill       tip      size
day  smoker
Fri  No       18.420000  2.812500  2.250000
     Yes      16.813333  2.714000  2.066667
Sat  No       19.661778  3.102889  2.555556
     Yes      21.276667  2.875476  2.476190
Sun  No       20.506667  3.167895  2.929825
     Yes      24.120000  3.516842  2.578947
Thur No       17.113111  2.673778  2.488889
     Yes      19.190588  3.030000  2.352941

In [110]:
pd.pivot_table(tips,'total_bill','smoker')

        total_bill
smoker
No       19.188278
Yes      20.756344

In [111]:
pd.pivot_table(tips,'total_bill',['sex','smoker'],['day','time'])

day               Fri                   Sat        Sun   Thur
time           Dinner      Lunch     Dinner     Dinner Dinner      Lunch
sex    smoker
Female No      22.750  15.980000  19.003846  20.824286  18.78  15.899167
       Yes     12.200  13.260000  20.266667  16.540000    NaN  19.218571
Male   No      17.475        NaN  19.929063  20.403256    NaN  18.486500
       Yes     25.892  11.386667  21.837778  26.141333    NaN  19.171000